IdeaRS.OpenModel.Detail.Wall
Representation of Wall in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.Wall.Name
Name

IdeaRS.OpenModel.Detail.Wall.#ctor
Constructor

IdeaRS.OpenModel.Detail.Wall.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.Wall.MasterComponent
Master component

IdeaRS.OpenModel.Detail.Wall.MasterPoint
Master point 0 - 9

IdeaRS.OpenModel.Detail.Wall.InsertPoint
Insert point 0 - 9

IdeaRS.OpenModel.Detail.Wall.Edges
Lines of Element2D including edges, which are created by opening

IdeaRS.OpenModel.Detail.Wall.Position
Offset between MasterPoint and InsertPoint
If MasterPoint is null, position is from origin of coordinate system